
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(АктВыполненныхРабот)
	ТабДок = Новый ТабличныйДокумент;
	АктВыполненныхРабот(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура АктВыполненныхРабот(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваровИУслуг.АктВыполненныхРабот(ТабДок, ПараметрКоманды);
КонецПроцедуры
