
&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
	Объект.ДатаОкончания = '0001,01,01';
    КонецЕсли;
    Иначе
    Элементы.ДатаОкончания.Видимость = Истина;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()

	Если ЗначениеЗаполнено(Объект.Наименование)
	И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
	Объект.Наименование = "№" + Объект.Номер + " от " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " г ";
ИначеЕсли ЗначениеЗаполнено(Объект.Номер)
	И Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
	Объект.Наименование = "№" + Объект.Номер;
Иначе
	Объект.Наименование = " от " + Объект.ДатаНачала + " г ";
	КонецЕсли;
	
КонецПроцедуры

		


