Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Если Не ЗначениеЗаполнено(Ответственный) Тогда
	//	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//КонецЕсли;
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	Если СтруктураУчетнаяПолитика.СпособУчетаЗапасов = Перечисления.СпособыСписанияЗапасов.FEFO Тогда
		ОтражатьСрокГодности = Истина;
	Иначе
		ОтражатьСрокГодности = Ложь;
	КонецЕсли;
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчётный.Записывать = Истина;
	
    СчетКредита = ПланыСчетов.Хозрасчетный.РасчётыСПоставщиками;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПоступлениеТоваровИУслугТовары.Количество) КАК Количество,
	               |	ПоступлениеТоваровИУслугТовары.СрокГодности КАК СрокГодности,
	               |	СУММА(ПоступлениеТоваровИУслугТовары.Сумма) КАК Сумма,
	               |	ПоступлениеТоваровИУслугТовары.Номенклатура.СчётБухгалтерскогоУчёта КАК СчётБухгалтерскогоУчёта
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровИУслугТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровИУслугТовары.Номенклатура,
	               |	ПоступлениеТоваровИУслугТовары.СрокГодности,
	               |	ПоступлениеТоваровИУслугТовары.Номенклатура.СчётБухгалтерскогоУчёта";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Выборка.Сумма;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
		Если ОтражатьСрокГодности Тогда
			Движение.СрокГодности = Выборка.СрокГодности;
		КонецЕсли;

		Движение = Движения.Хозрасчётный.Добавить();
		Движение.СчетДт = Выборка.СчётБухгалтерскогоУчёта;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчётыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Сумма;
		Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчётные.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчётные.Контрагенты] = Контрагент; 
		
КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	СУММА(ПоступлениеТоваровИУслугУслуги.Сумма) КАК Сумма,
	               |	ПоступлениеТоваровИУслугУслуги.Услуга.СчётБухгалтерскогоУчёта КАК СчётБухгалтерскогоУчёта,
	               |	ПоступлениеТоваровИУслугУслуги.Услуга КАК Услуга
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровИУслугУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат,
	               |	ПоступлениеТоваровИУслугУслуги.Услуга,
	               |	ПоступлениеТоваровИУслугУслуги.Услуга.СчётБухгалтерскогоУчёта";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл			 
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.СтатьяЗатрат = Выборка.СтатьяЗатрат;
			Движение.Сумма = Выборка.Сумма;
			
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
	Пока Выборка.Следующий() Цикл		
	        Движение = Движения.Хозрасчётный.Добавить();
			Движение.СчетДт = Выборка.СчётБухгалтерскогоУчёта;
			Движение.СчетКт = СчетКредита;
	        Движение.Период = Дата;
	        Движение.Сумма = Выборка.Сумма;
	        Движение.Содержание = "Отражено поступление услуг от поставщика";
	        БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Выборка.СтатьяЗатрат);
	        БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент);
	КонецЦикла;				
	КонецЦикла;
	
КонецПроцедуры



