
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаказНаряд)
	ТабДок = Новый ТабличныйДокумент;
	ЗаказНаряд(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ЗаказНаряд(ТабДок, ПараметрКоманды)
	Документы.ЗаказНаряд.ЗаказНаряд(ТабДок, ПараметрКоманды);
КонецПроцедуры
