
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	 СформировтьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	 СформировтьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	 СформировтьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
	 СформировтьФИО();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформировтьФИО()
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
КонецПроцедуры




