

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
	     Элементы.ДлительностьУслуги.Видимость = Истина;
	 Иначе
		 Элементы.ДлительностьУслуги.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента") Тогда
		Элементы.СчётБухгалтерскогоУчёта.Видимость = Ложь;
	Иначе
		Элементы.СчётБухгалтерскогоУчёта.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		Объект.СчётБухгалтерскогоУчёта = ПолучитьЗначениеПланаСчетовМатериал(Объект.СчётБухгалтерскогоУчёта);
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Объект.СчётБухгалтерскогоУчёта = ПолучитьЗначениеПланаСчетовТовар(Объект.СчётБухгалтерскогоУчёта);
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Объект.СчётБухгалтерскогоУчёта = ПолучитьЗначениеПланаСчетовУслуги(Объект.СчётБухгалтерскогоУчёта);
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Родитель = ПредопределенноеЗначение("Справочник.Номенклатура.Материалы") Тогда
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал");
		
	ИначеЕсли Объект.Родитель =  ПредопределенноеЗначение("Справочник.Номенклатура.МатериалыКлиента") Тогда
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента");
		
	ИначеЕсли Объект.Родитель = ПредопределенноеЗначение("Справочник.Номенклатура.Товары") Тогда
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
		
	ИначеЕсли Объект.Родитель = ПредопределенноеЗначение("Справочник.Номенклатура.Услуги") Тогда
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");
		
	Иначе
		Объект.Родитель = Неопределено;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПланаСчетовМатериал(СчетБухгалтерскогоУчета)
	Запрос = Новый Запрос;                
	Запрос.УстановитьПараметр("Ссылка", СчетБухгалтерскогоУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Код = ""10""";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПланаСчетовТовар(СчетБухгалтерскогоУчета)
	Запрос = Новый Запрос;                
	Запрос.УстановитьПараметр("Ссылка", СчетБухгалтерскогоУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Код = ""41""";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПланаСчетовУслуги(СчетБухгалтерскогоУчета)
	Запрос = Новый Запрос;                
	Запрос.УстановитьПараметр("Ссылка", СчетБухгалтерскогоУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Код = ""44""";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции

&НаКлиенте
Процедура СчётБухгалтерскогоУчётаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокДоступныхЗначений = Новый СписокЗначений;
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы"));
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы"));
	Иначе
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
	КонецЕсли;
	
	ДанныеВыбора = СписокДоступныхЗначений;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.СчётБухгалтерскогоУчёта) Тогда
		Объект.СчётБухгалтерскогоУчёта = ПолучитьЗначениеПланаСчетовТовар(Объект.СчётБухгалтерскогоУчёта);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипНоменклатуры) Тогда
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
	КонецЕсли;
КонецПроцедуры

 
