
&НаКлиенте
Процедура МодельПриИзменении(Элемент)	
	   СформироватьНаименование();	
КонецПроцедуры

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()	
	Объект.Наименование = СокрЛП(Объект.Модель.Наименование) + "(" + "VIN:" + СокрЛП(Объект.VIN) + ")";	
КонецПроцедуры

