
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Длина = СтрДлина(Объект.ИНН);
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") И Длина <> 12 Тогда
		  Отказ = Истина;
		  Сообщить(Объект.ИНН + " Недопустимый номер для ИНН ");
    КонецЕсли;
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") И Длина <> 10 Тогда
		 Отказ = Истина;
		 Сообщить(Объект.ИНН + " Недопустимый номер для ИНН ");
	 КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

